# Циклы

## Цикл while

```python
i = 0

while i < 10:
    print(i)
    i = i + 1 
# 0
# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8
# 9
```

## Цикл for, объект range
Выражение for .. in это еще один способ выполнить блок кода - но оно позволяет выполнить блок кода для каждого из элементов из последовательности

```python
name = "Alex"

for letter in name:
    print(letter)
# A
# l
# e
# x
```

В качестве n может использоваться числовая константа, переменная или произвольное арифметическое выражение (например, `2 * 4`). Если значение n равно нулю или отрицательное, то тело цикла не выполнится ни разу.
```python
for i in range(3):
    print(i)
# 0
# 1
# 2
```

Вызов range(a, b) означает, что индексная переменная будет принимать значения от `a` до `b - 1`
```python
for i in range(5, 8):
    print(i)
# 5
# 6
# 7
```

Вызов range(a, b, c) означает, что индексная переменная будет принимать значения от `a` до `b - 1` с шагом `c`
```python
for i in range(1, 10, 2):
    print(i)
# 1
# 3
# 5
# 7
# 9
```

Вызов range(a, b, c) означает, что индексная переменная будет в убывающем порядке
```python
for i in range(10, 1, -1):
    print(i)
# 10
# 9
# 8
# 7
# 6
# 5
# 4
# 3
# 2
```

### break
Оператор break позволяет выйти из цикла досрочно:


```python
result = 0

while True:
    result += 1
    if result >= 10:
        break

print(result)
# 10
```

```python
for i in range(10):
    if i == 5:
        break
    print(i)
# 0
# 1
# 2
# 3
# 4
```

### continue
Оператор continue используется, когда в блоке цикла нужно перейти к следующей итерации цикла без выполнения оставшихся инструкций в блоке:

```python
for i in range(10):
    if i % 2 != 0:
        continue
    print(i)
# 0
# 2
# 4
# 6
# 8
```

## Практика

#### Задача «Ряд - 1»
Даны два целых числа A и B (при этом A ≤ B). 
Выведите все числа от A до B включительно.

| Входные данные | Правильный ответ |
|----------------|------------------|
|a=1, b=10  | 1 2 3 4 5 6 7 8 9 10 |
|a=-3, b=14  | -3 -2 -1 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 |
|a=0, b=0  | 0 |
|a=20, b=20  | 20 |

#### Задача «Ряд - 2»
Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если `A < B`, или в порядке убывания в противном случае.

| Входные данные | Правильный ответ |
|----------------|------------------|
|a=1, b=10  | 1 2 3 4 5 6 7 8 9 10 |
|a=10, b=1  | 10 9 8 7 6 5 4 3 2 1 |
|a=179, b=179  | 179 |
|a=-14, b=21  | -14 -13 -12 -11 -10 -9 -8 -7 -6 -5 -4 -3 -2 -1 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 |
|a=12, b=-5  | 12 11 10 9 8 7 6 5 4 3 2 1 0 -1 -2 -3 -4 -5 |
|a=-3, b=-7  | -3 -4 -5 -6 -7 |
```python
a = int(input("A:"))
b = int(input("B:"))
j = 1
if a > b:
    j = -1
    
for i in range(a, b + j, j):
        print(i)
```

#### Задача «Сумма десяти чисел»
Дано 10 целых чисел. Вычислите их сумму. Напишите программу, использующую наименьшее число переменных.

| Входные данные | Правильный ответ |
|----------------|------------------|
| 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 | 45 |
| 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 | 10 |
| 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 | 55 |
| 8, 4, 5, 3, 9, 2, 3, 4, 5, 1 | 44 |
| 758, 483, 893, 393, 293, 292, 292, 485, 828, 182 | 4899 |
| -1, -2, -3, -4, -5, -6, -7, -8, -9, 0 | -45 |

```python
summa = 0
for i in range(10):
    a = int(input(f"input number {i+1}:"))
    a = a + a
print(summa)
```

#### Задача «Количество знаков в строке»
Дана строка. Посчитайте количество символов в строке. Пользователь вводит строку (s), затем вводит искомый символ (f).

for i in 'abcd':
    print(i)
    
| Входные данные | Правильный ответ |
|----------------|------------------|
| s="Beautiful is better than ugly", f="e" | 3 |
| s="Beautiful is better than ugly", f="t" | 4 |
| s="Beautiful is better than ugly", f="b" | 2 |
| s="Beautiful is better than ugly", f="k" | 0 |

#### Задача «Количество слов в предложении»
Дана строка. Посчитайте количество слов в строке.

| Входные данные | Правильный ответ |
|----------------|------------------|
| "Beautiful is better than ugly" | 5 |
| "Special cases aren't special enough to break the rules" | 9 |
| "Unless explicitly silenced." | 3 |
| "Hello" | 1 |
| "" | 0 |


#### Задача «Лесенка»
По данному натуральному `n > 0` и `n < 10` выведите лесенку из n ступенек.

| Входные данные | Правильный ответ |
|----------------|------------------|
| n=3 | 1<br/>12<br/>123 |
| n=4 | 1<br/>12<br/>123<br/>1234 |
| n=2 | 1<br/>12 |
| n=5 | 1<br/>12<br/>123<br/>1234<br/>12345 |
| n=9 | 1<br/>12<br/>123<br/>1234<br/>12345<br/>123456<br/>1234567<br/>12345678<br/>123456789 |
