"""
Написать функцию sum_func, которая принимает 2 параметра и возвращает их сумму.
Обработать все возможные ошибки
"""

def sum_func(a, b):
    return a + b

print(sum_func(5, 6))